_org_posts/_posts/2022-01-17-boj-17478.org
#+HTML: ---
#+HTML: title: BOJ 17478 재귀함수가 뭔가요?
#+HTML: tags: 재귀
#+HTML: toc: true
#+HTML: toc_sticky: true
#+HTML: ---
#+OPTIONS: ^:nil

** BOJ 17478 재귀함수가 뭔가요?
- 재귀함수 형태로 문자열 출력 규칙 파악하기 

** 접근하기
#+BEGIN_EXAMPLE
f(0) ----> f(1) ----> f(2) 
0칸띄움    4칸띄움    8칸 띄움


f(num)
{
   if (num > N) {
     hello ans
   }
  
   if (num == N)
       hello ans
   else
       hello begin
   f(x)
   hello end
}

hello begin
    hello begin
        hello ans
        hello end
    hello end
hello end
#+END_EXAMPLE

** 코드
#+BEGIN_SRC cpp
#include <bits/stdc++.h>
using namespace std;

int N ;

void f(int depth)
{
    if (depth > N) return;
    
    string line = "";
    for(int i=0;i<depth;i++) {
        line += "____";
    }
    cout << line << "\"재귀함수가 뭔가요?\"\n";

    if (N != depth) {
        cout << line << "\"잘 들어보게. 옛날옛날 한 산 꼭대기에 이세상 모든 지식을 통달한 선인이 있었어.\n";
        cout << line << "마을 사람들은 모두 그 선인에게 수많은 질문을 했고, 모두 지혜롭게 대답해 주었지.\n";
        cout << line << "그의 답은 대부분 옳았다고 하네. 그런데 어느 날, 그 선인에게 한 선비가 찾아와서 물었어.\"\n";
    } else {
        cout << line << "\"재귀함수는 자기 자신을 호출하는 함수라네\"\n";

    }
    f(depth + 1);
    cout << line << "라고 답변하였지.\n";

}

int main(int argc, char* argv[])
{
    scanf("%d", &N);
    cout << "어느 한 컴퓨터공학과 학생이 유명한 교수님을 찾아가 물었다.\n";
    f(0);
    return 0;
}
#+END_SRC

** 문제 링크
- https://www.acmicpc.net/problem/17478
