_posts/2022-01-17-boj-17478.html
---
title: BOJ 17478 재귀함수가 뭔가요?
tags: 재귀
---

<div id="outline-container-org22d3259" class="outline-2">
<h2 id="org22d3259">BOJ 17478 재귀함수가 뭔가요?</h2>
<div class="outline-text-2" id="text-org22d3259">
<ul class="org-ul">
<li>재귀함수 형태로 문자열 출력 규칙 파악하기</li>
</ul>
</div>
</div>

<div id="outline-container-orgeae9b53" class="outline-2">
<h2 id="orgeae9b53">접근하기</h2>
<div class="outline-text-2" id="text-orgeae9b53">
<pre class="example">
f(0) ----&gt; f(1) ----&gt; f(2) 
0칸띄움    4칸띄움    8칸 띄움


f(num)
{
   if (num &gt; N) {
     hello ans
   }
  
   if (num == N)
       hello ans
   else
       hello begin
   f(x)
   hello end
}

hello begin
    hello begin
        hello ans
        hello end
    hello end
hello end
</pre>
</div>
</div>

<div id="outline-container-org323773a" class="outline-2">
<h2 id="org323773a">코드</h2>
<div class="outline-text-2" id="text-org323773a">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span> ;

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">f</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">depth</span>)
{
    <span style="color: #729fcf; font-weight: bold;">if</span> (depth &gt; N) <span style="color: #729fcf; font-weight: bold;">return</span>;

    <span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347;">line</span> = <span style="color: #ad7fa8; font-style: italic;">""</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;depth;i++) {
        line += <span style="color: #ad7fa8; font-style: italic;">"____"</span>;
    }
    cout &lt;&lt; line &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">"\"&#51116;&#44480;&#54632;&#49688;&#44032; &#47956;&#44032;&#50836;?\"\n"</span>;

    <span style="color: #729fcf; font-weight: bold;">if</span> (N != depth) {
        cout &lt;&lt; line &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">"\"&#51096; &#46308;&#50612;&#48372;&#44172;. &#50715;&#45216;&#50715;&#45216; &#54620; &#49328; &#44845;&#45824;&#44592;&#50640; &#51060;&#49464;&#49345; &#47784;&#46304; &#51648;&#49885;&#51012; &#53685;&#45804;&#54620; &#49440;&#51064;&#51060; &#51080;&#50632;&#50612;.\n"</span>;
        cout &lt;&lt; line &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">"&#47560;&#51012; &#49324;&#46988;&#46308;&#51008; &#47784;&#46160; &#44536; &#49440;&#51064;&#50640;&#44172; &#49688;&#47566;&#51008; &#51656;&#47928;&#51012; &#54664;&#44256;, &#47784;&#46160; &#51648;&#54812;&#47213;&#44172; &#45824;&#45813;&#54644; &#51452;&#50632;&#51648;.\n"</span>;
        cout &lt;&lt; line &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">"&#44536;&#51032; &#45813;&#51008; &#45824;&#48512;&#48516; &#50739;&#50520;&#45796;&#44256; &#54616;&#45348;. &#44536;&#47088;&#45936; &#50612;&#45712; &#45216;, &#44536; &#49440;&#51064;&#50640;&#44172; &#54620; &#49440;&#48708;&#44032; &#52286;&#50500;&#50752;&#49436; &#47932;&#50632;&#50612;.\"\n"</span>;
    } <span style="color: #729fcf; font-weight: bold;">else</span> {
        cout &lt;&lt; line &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">"\"&#51116;&#44480;&#54632;&#49688;&#45716; &#51088;&#44592; &#51088;&#49888;&#51012; &#54840;&#52636;&#54616;&#45716; &#54632;&#49688;&#46972;&#45348;\"\n"</span>;

    }
    f(depth + 1);
    cout &lt;&lt; line &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">"&#46972;&#44256; &#45813;&#48320;&#54616;&#50688;&#51648;.\n"</span>;

}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);
    cout &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">"&#50612;&#45712; &#54620; &#52980;&#54504;&#53552;&#44277;&#54617;&#44284; &#54617;&#49373;&#51060; &#50976;&#47749;&#54620; &#44368;&#49688;&#45784;&#51012; &#52286;&#50500;&#44032; &#47932;&#50632;&#45796;.\n"</span>;
    f(0);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1a2a59b" class="outline-2">
<h2 id="org1a2a59b">문제 링크</h2>
<div class="outline-text-2" id="text-org1a2a59b">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/17478">https://www.acmicpc.net/problem/17478</a></li>
</ul>
</div>
</div>
